{"/_app":{"title":" App","data":{"":""}},"/guides/git":{"title":"Git","data":{"":"Git, değişikliklerin etkili bir şekilde izlenmesine, birleştirilmesine ve geri alınmasına olanak tanıyan bir sürüm kontrol sistemidir.Kaynaklarımız GitHub'da barındırıldığından, değişiklikleri takip etmek ve güncel kalmak için kendi veri havuzunuzu nasıl oluşturacağınızı öğrenmek inanılmaz derecede faydalı olabilir. Kaynaklarımızda kendi değişikliklerinizi yapmayı planlıyorsanız bu, kendi değişikliklerinizi saklamanıza ve veri kaybını önlemenize olanak tanır.\nBuradan indirin ve kurulumu tamamlayın."}},"/guides/vscode":{"title":"VS Code","data":{"":"Lua ile çalışırken önerdiğimiz düzenleyicimiz Visual Studio Code'dur."}},"/":{"title":"Anasayfa","data":{"":"Burada Open Source Wizards ekibi tarafından geliştirilen ya da düzenlenen kaynaklara ilişkin tüm resmi belgeleri bulabilirsiniz. Fivem Roleplay sunucu alt yapısı için kullanılan, geliştirilen her türlü içeriğin dökümantastonu burada tutulmaktadır.","ekibimizi-destekleyin#Ekibimizi Destekleyin":"Geliştiricilerimizin gönüllü olarak çalışmasıyla oluşan bu sunucuda, yaptıkları işlere katkıda bulunmak istiyorsanız takip edip iletişime geçebilirsiniz. Her birinin ayrı ayrı emeği olmasaydı, böyle bir yer de olmayacaktı."}},"/osw-archive":{"title":"OSW Archive","data":{"":"Veritabanı şeysileri."}},"/osw-archive/options":{"title":"Ayarlar","data":{"":""}},"/osw-blips":{"title":"OSW Blips","data":{"":"ox_core, qb-core ve es_extended için ek işlevlere sahip, performanslı ve esnek, bağımsız bir sinyal üreteci.","yükleme#Yükleme":"Git, Node.js ve NPM'i ayarlamak için şiddetle Guides adresine başvurmanızı öneririz.","tüm-kaynak-bağımlılıklarını-yükleyin#Tüm kaynak bağımlılıklarını yükleyin.":"osw-archive","yayınlanmış-bir-sürüm-indirin-veya-kaynak-kodunu-kopyalayın#Yayınlanmış bir sürüm indirin veya kaynak kodunu kopyalayın.":"git clone https://github.com/opensourcewizards/blips.git","desteklenen-yapılar#Desteklenen Yapılar":"Aşağıdaki yapılar ile sorunsuz çalışmaktadır.\nox_core\nesx\nqb-core\n\n\nOSW Blips çalışmak için yukarıdaki yapıların hiçbirine ihtiyaç duymamaktadır."}},"/osw-blips/options":{"title":"Ayarlar","data":{"":"Bir blip oluştururken aşağıdaki özelliklere sahip bir dizi seçenek göndermelisiniz.","parametreler#Parametreler":"title: string\nshow: boolean\nBlip'i göstermek ya da kaldırmak için kullanılır.\n\n\ncolor: number\nBlip rengini Fivem Blip Renkleri kısmından seçebilirsiniz.\n\n\nid: number\nBlip görünümünü Fivem Blip Listesi kısmından seçebilirsiniz.\n\n\nscale: number\nBlip boyutu\n\n\ncoords: object\ncoords.x: number\ncoords.y: number\ncoords.z: number\nradius?: object\nradius.show: boolean\nradius.color: number\nradius.area: number"}},"/osw-core":{"title":"OSW Core","data":{"":"Yapının temeli."}},"/osw-library":{"title":"OSW Library","data":{"":"Diğer modüllerin kullanabileceği çeşitli araçlar havuzu."}},"/osw-library/options":{"title":"Ayarlar","data":{"":""}},"/guides/nodejs":{"title":"Node.JS","data":{"":"Node.JS bir JavaScript runtime'dır ve uygulama oluşturmak için kullanılır. FiveM bağlamında, kaynakları hem sunucuda hem de istemcide çalıştırılabilecek tek bir pakette toplamak gerekir.\nNode.JS'nin LTS sürümünü indirin ve yükleyin.\nBir komut satırı terminali açın (örn. Terminal, Komut İstemi, Windows Power Shell).\nKurulumun doğru olduğunu onaylamak için node --version yazın."}},"/guides/vscode/recommended":{"title":"Önerilen Eklentiler","data":{"":"Uzantılar, VS Code'a diller, hata ayıklayıcılar ve diğer araçları eklemenizi sağlayarak geliştirici deneyiminizi arttırır.","sumnekolua#sumneko.lua":"Lua Language Server, geliştirmeyi daha kolay ve hızlı hale getirmek için çok sayıda dil özelliği sağlar;\nEk açıklamalar\nOtomatik tamamlama\nKod biçimlendirme\nTeşhis/uyarılar\nDinamik tip kontrolü\nSözdizimi kontrolü","overextendedcfxlua-vscode#overextended.cfxlua-vscode":"Cfx'in Lua runtime'ından fonksiyon ve yazım hatası ikazları sağlamak için Lua Language Server ile birlikte çalışır. Lua dili, küresel yapılar ve oyuna gömülü kodları barındır."}}}